pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
/* OpenSprinkler Unified (AVR/RPI/BBB/LINUX) Firmware
 * Copyright (C) 2015 by Ray Wang (ray@opensprinkler.com)
 *
 * OpenSprinkler library
 * Feb 2015 @ OpenSprinkler.com
 *
 * This file is part of the OpenSprinkler library
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see
 * <http://www.gnu.org/licenses/>.
 */
#include "Defines.h"
#include "OpenSprinkler.h"
#include "Gpio.h"

#if defined(ESP8266) || defined(ESP32)
#ifdef SPIFFSDAT
#include <FS.h>
#define sd SPIFFS
#define FIL file
#endif
//#include "PCF8574/PCF8574.h"
#include "PCF8574Mio.h"


#endif

#ifdef PCF8574_M
PCF8574 PCF[10];//_38(0x3F);  // add switches to lines  (used as input)
 //PCF8574 PCF_39(0x3F);  // add leds to lines      (used as output)


 //
 //            pin HACKING FUNCTIONS 
 //            if PIN_NUMBER > MAX MCU PINS (16 for ESP8266) PINs are assigned to PCF 8574 I/O lines 
 //				(16 pins reserved for each IC) (in the order given by ESP8266 address)
 //
#define MAX_MCU_PINS 32
#define pinMode(x,y) if(x<MAX_MCU_PINS) pinMode(x,y);else{DEBUG_PRINT(x); DEBUG_PRINT(" at PCF_addr ");DEBUG_PRINTLN((x - MAX_MCU_PINS) / 16);}//verify pin on Ic??
#define digitalWrite(x,y) (x<MAX_MCU_PINS)? digitalWrite(x,y) :PCF[(x - MAX_MCU_PINS) / 16].write((byte)(x - MAX_MCU_PINS) % 16, y)//;DEBUG_PRINT("<W");DEBUG_PRINT(x);DEBUG_PRINT(">");DEBUG_PRINT(y) //verify pin on Ic??
#define digitalRead(x)   (x<MAX_MCU_PINS)? digitalRead(x): PCF[(x-MAX_MCU_PINS)/16].read((x-MAX_MCU_PINS)%16)
#else
#define pinMode(x, y)  pinMode(x, y)          //verify pin on Ic??
#define digitalWrite(x,y)  digitalWrite(x,y)
#define digitalRead(x)   digitalRead(x)
#endif
#ifndef ESP32 ////--
extern "C" {
#include "user_interface.h"
	uint16 readvdd33(void);
	bool wifi_set_sleep_type(sleep_type_t);
	sleep_type_t wifi_get_sleep_type(void); 
}
#endif
/** Declare static data members */
NVConData OpenSprinkler::nvdata;
ConStatus OpenSprinkler::status;
ConStatus OpenSprinkler::old_status;
byte OpenSprinkler::hw_type;

byte OpenSprinkler::nboards;
byte OpenSprinkler::nstations;
byte OpenSprinkler::station_bits[MAX_EXT_BOARDS+1];
#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
byte OpenSprinkler::engage_booster;
#endif

ulong OpenSprinkler::sensor_lasttime;
ulong OpenSprinkler::flowcount_log_start;
ulong OpenSprinkler::flowcount_rt;
ulong OpenSprinkler::flowcount_time_ms;
ulong OpenSprinkler::raindelay_start_time;
byte OpenSprinkler::button_timeout;
ulong OpenSprinkler::checkwt_lasttime;
ulong OpenSprinkler::checkwt_success_lasttime;
char tmp_buffer[TMP_BUFFER_SIZE+1];       // scratch buffer

#ifdef OPENSPRINKLER_ARDUINO_DISCRETE
int OpenSprinkler::station_pins[16] =
{
    PIN_STN_S01, PIN_STN_S02, PIN_STN_S03, PIN_STN_S04, PIN_STN_S05, PIN_STN_S06, PIN_STN_S07, PIN_STN_S08
#ifdef PIN_STN_S09
	,PIN_STN_S09, PIN_STN_S10, PIN_STN_S11, PIN_STN_S12, PIN_STN_S13, PIN_STN_S14, PIN_STN_S15, PIN_STN_S16
#endif
};
#endif // OPENSPRINKLER_ARDUINO_DISCRETE

//#ifndef OPENSPRINKLER_ARDUINO			  // Moved to opensprinkler.h
#if PROGM
prog_char wtopts_filename[] PROGMEM = WEATHER_OPTS_FILENAME;
prog_char stns_filename[]   PROGMEM = STATION_ATTR_FILENAME;
#else
char wtopts_filename[] = WEATHER_OPTS_FILENAME;
char stns_filename[]   = STATION_ATTR_FILENAME;
#endif
//#endif

#if defined(ARDUINO)

#ifdef OPENSPRINKLER_ARDUINO_FREETRONICS_LCD
LiquidCrystal OpenSprinkler::lcd ( PIN_LCD_RS, PIN_LCD_EN, PIN_LCD_D4, PIN_LCD_D5, PIN_LCD_D6, PIN_LCD_D7 );
#else
#ifdef LCDI2C

#ifdef LCD_SSD1306
#ifndef LCD_RST
#define LCD_RST -1
#endif
Adafruit_SSD1306 OpenSprinkler::lcd(LCD_RST);

#else

#define BACKLIGHT_PIN PIN_LCD_BACKLIGHT
//LiquidCrystal_I2C	OpenSprinkler::lcd(0X27, 2, 1, 0, 4, 5, 6, 7);
LiquidCrystal_I2C OpenSprinkler::lcd(LCD_ADDR, PIN_LCD_EN, PIN_LCD_RW, PIN_LCD_RS, PIN_LCD_D4, PIN_LCD_D5, PIN_LCD_D6, PIN_LCD_D7);
#endif
#else
LiquidCrystal OpenSprinkler::lcd;
#endif
#endif

#if defined(ESP8266) || defined(ESP32)
#ifndef SDFAT
#include <FS.h>
//#include "SPIFFSdFat.h"
#else 
#include <SD.h>
#include <SdFat.h>
extern SdFat sd;
#endif


#endif


#elif defined(OSPI)
// 
: LCD define for OSPi
#endif

#ifdef BATTERY
 static Adafruit_INA219 ina(0x040);
#endif

#if defined(OSPI)
byte OpenSprinkler::pin_sr_data = PIN_SR_DATA;
#endif

/** Option json names (stored in progmem) */
// IMPORTANT: each json name is strictly 5 characters
// with 0 fillings if less
#define OP_JSON_NAME_STEPSIZE 5
//#ifndef OPENSPRINKLER_ARDUINO	// Moved to opensprinkler.h
#if PROGM
prog_char op_json_names[] PROGMEM =
#else
char op_json_names[] =
#endif
"fwv\0\0"
"tz\0\0\0"
"ntp\0\0"
"dhcp\0"
"ip1\0\0"
"ip2\0\0"
"ip3\0\0"
"ip4\0\0"
"gw1\0\0"
"gw2\0\0"
"gw3\0\0"
"gw4\0\0"
"hp0\0\0"
"hp1\0\0"
"hwv\0\0"
"ext\0\0"
"seq\0\0"
"sdt\0\0"
"mas\0\0"
"mton\0"
"mtof\0"
"urs\0\0"
"rso\0\0"
"wl\0\0\0"
"den\0\0"
"ipas\0"
"devid"
"con\0\0"
"lit\0\0"
"dim\0\0"
"bst\0\0"
"uwt\0\0"
"ntp1\0"
"ntp2\0"
"ntp3\0"
"ntp4\0"
"lg\0\0\0"
"mas2\0"
"mton2"
"mtof2"
"fwm\0\0"
"fpr0\0"
"fpr1\0"
"re\0\0\0"
"reset"
#ifdef BATTERY
"DsleD"
"DsleS"
"DsleI"
"DsleV"
"LsleV"
"LsleP"
"batAh"
#endif
;
// OPENSPRINKLER_ARDUINO

/** Option promopts (stored in progmem, for LCD display) */
// Each string is strictly 16 characters
// with SPACE fillings if less
#if PROGM
prog_char op_prompts[] /*PROGMEM*/ =
#else
char op_prompts[] =
#endif
    "Firmware version"
    "Time zone (GMT):"
    "Enable NTP sync?"
    "Enable DHCP?    "
    "Static.ip1:     "
    "Static.ip2:     "
    "Static.ip3:     "
    "Static.ip4:     "
    "Gateway.ip1:    "
    "Gateway.ip2:    "
    "Gateway.ip3:    "
    "Gateway.ip4:    "
    "HTTP Port:      "
    "----------------"
    "Hardware version"
    "# of exp. board:"
    "----------------"
    "Stn. delay (sec)"
    "Master 1 (Mas1):"
    "Mas1  on adjust:"
    "Mas1 off adjust:"
    "Sensor type:    "
    "Normally open?  "
    "Watering level: "
    "Device enabled? "
    "Ignore password?"
    "Device ID:      "
    "LCD contrast:   "
    "LCD brightness: "
    "LCD dimming:    "
    "DC boost time:  "
    "Weather algo.:  "
    "NTP server.ip1: "
    "NTP server.ip2: "
    "NTP server.ip3: "
    "NTP server.ip4: "
    "Enable logging? "
    "Master 2 (Mas2):"
    "Mas2  on adjust:"
    "Mas2 off adjust:"
    "Firmware minor: "
    "Pulse rate:     "
    "----------------"
    "As remote ext.? "
    "Factory reset?  "
#ifdef BATTERY
    "deep sleep dur. "					
	"deep sleep start"					
	"deep sleep inter"					
	"min bat v Dsleep"                 
	"min V L sleep   " 				
	"lightslepp delay"			
	"battery capacity"			
#endif
	;

/** Option maximum values (stored in progmem) */

