pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
//#ifndef OPENSPRINKLER_ARDUINO	// Moved to opensprinkler.h
#if PROGM
prog_char op_max[] PROGMEM =
{
#else
char op_max[] =
{
#endif
    0,
    108,
    1,
    1,
    255,
    255,
    255,
    255,
    255,
    255,
    255,
    255,
    255,
    255,
    0,
    MAX_EXT_BOARDS,
    1,
    247,
    MAX_NUM_STATIONS,
    60,
    120,
    255,
    1,
    250,
    1,
    1,
    255,
    255,
    255,
    255,
    250,
    255,
    255,
    255,
    255,
    255,
    1,
    MAX_NUM_STATIONS,
    60,
    120,
    0,
    255,
    255,
    1,
    1
#ifdef BATTERY
	, 255,  //min deep sleep duration						D_SLEEP_DURATION
	255,  //h deep sleep start							D_SLEEP_START_TIME
	255,  //h deep sleep interval						D_SLEEP_INTERVAL
	255,  //mV minimum battery voltage start of deep sleeMIN_VOLTS_D_SLEEP
	255,  //mV voltage start of light sleep				MIN_VOLTS_L_SLEEP
	255,    //s light sleep delay time						L_SLEEP_DURATION
	255  //mAh battery capacity							BATTERY_mAH
#endif
};
//#endif // OPENSPRINKLER_ARDUINO
#define DB_MASK 1
/** Option values (stored in RAM) */
byte OpenSprinkler::options[] =
{
    OS_FW_VERSION, // firmware version
    28, // default time zone: GMT-5
    1,  // 0: disable NTP sync, 1: enable NTP sync
    1,  // 0: use static ip, 1: use dhcp
    0,  // this and next 3 bytes define static ip
    0,
    0,
    0,
    0,  // this and next 3 bytes define static gateway ip
    0,
    0,
    0,
#if defined(ARDUINO)  // on AVR, the default HTTP port is 80
    80, // this and next byte define http port number
    0,
#else // on RPI/BBB/LINUX, the default HTTP port is 8080
    144,// this and next byte define http port number
    31,
#endif
    OS_HW_VERSION,
    0,  // number of 8-station extension board. 0: no extension boards
    1,  // the option 'sequential' is now retired
    128,// station delay time (-59 minutes to 59 minutes).
    0,  // index of master station. 0: no master station
    0,  // master on time [0,60] seconds
    60, // master off time [-60,60] seconds
    0,  // sensor function (see SENSOR_TYPE macro defines)
    0,  // rain sensor type. 0: normally closed; 1: normally open.
    100,// water level (default 100%),
    1,  // device enable
    0,  // 1: ignore password; 0: use password
    0,  // device id
    150,// lcd contrast
    100,// lcd backlight
    15, // lcd dimming
    80, // boost time (only valid to DC and LATCH type)
    0,  // weather algorithm (0 means not using weather algorithm)
    132, // this and the next three bytes define the ntp server ip
    163,
    4,
    101,
    1,  // enable logging: 0: disable; 1: enable.
    0,  // index of master 2. 0: no master2 station
    0,
    60,
    OS_FW_MINOR, // firmware minor version
    100,// this and next byte define flow pulse rate (100x)
    0,
    0,  // set as remote extension
    0	   // reset

		   //
#ifdef BATTERY
	,
// options for battery operated
 60,    //m deep sleep duration						D_SLEEP_DURATION
 22,    //h deep sleep start							D_SLEEP_START_TIME
 8,     //h deep sleep interval						D_SLEEP_INTERVAL
 32,    //V*10 minimum battery voltage start of deep sleeMIN_VOLTS_D_SLEEP
 34,    //V*10 voltage start of light sleep				MIN_VOLTS_L_SLEEP
 30,   //s light sleep delay time						L_SLEEP_DURATION
 48    //10*Ah battery capacity							BATTERY_mAH
//
#endif
};
static float charge=0;
unsigned long chargeTime=0;
/** Weekday strings (stored in progmem, for LCD display) */
static prog_char days_str[]/* PROGMEM*/ =
    "Mon\0"
    "Tue\0"
    "Wed\0"
    "Thu\0"
    "Fri\0"
    "Sat\0"
    "Sun\0";

/** Calculate local time (UTC time plus time zone offset) */
time_t OpenSprinkler::now_tz()
{
    return now()+ ( int32_t ) 3600/4* ( int32_t ) ( options[OPTION_TIMEZONE]-48 );
}

#if defined(ARDUINO)  // AVR network init functions

//static PCF8574 PCF[10];


enum I2Cdev_t
{
	PCF8574_TYPE,
	PCF8574A_TYPE,
	RTC_TYPE,
	EEPROM_TYPE,
	
};
byte ADR[4] = {
	0x20,
	0x38,
	0x64,
	0x50
};
byte ADR_R[4] = {
	8,
	8,
	16,
	8
};
bool ADR_TYP[4] = {
	true,
	true,
	false,
	false
};
String ADR_DEV_NAME[4] = {

	"PCF8574",
	"PCF8574A",
	"DS3231",
	"AT24Cxx"
};
void ScanI2c()
{
	byte address[20];
	byte error;
	int nDevices;
#ifdef DS1307RTC==I2CRTC
	Serial.println("detecting RTC....");
	RTC.detect();
#endif
	Serial.println("Scanning..I2C.....");

	nDevices = 0;
	for (byte addres = 1; addres < 127; addres++)
	{
		// The i2c_scanner uses the return value of
		// the Write.endTransmisstion to see if
		// a device did acknowledge to the address.
		Wire.beginTransmission(addres);
		error = Wire.endTransmission();
		bool trov = false;
		byte trova = 255;
		if (error == 0)
		{
			Serial.print("I2C device found at address 0x");
			if (addres < 16)
				Serial.print("0");
			Serial.print(addres, HEX);
			Serial.print("\t");
			byte id = 0;
			while (id < 4) {
				if (addres >= ADR[id] && addres < ADR[id] + ADR_R[id]) {
					Serial.println(ADR_DEV_NAME[id]); trov = true;
					trova = id;

				}
				id++;
			}
			if (!trov) Serial.println(" unknown");
		}
		if (trova != 255&&trov)
			if (ADR_TYP[trova]) {
#ifdef LCD_ADDR                                               //do not count LCD controller if LCD i2c library is used
		        if (addres == LCD_ADDR)Serial.println("found LCD Controller"); 
				else
#endif
				{
					address[nDevices] = addres;
					nDevices++;
#ifdef PCF8574_M
					DEBUG_PRINT("PCF expander "); DEBUG_PRINT(nDevices - 1); DEBUG_PRINT("at"); DEBUG_PRINTLN(addres);
					PCF[nDevices - 1].begin(addres);
#else
					Serial.println("error Pcf_dev set: #define PCF8574_M in Pins.h");
#endif
				}
			}
			else if (error == 4)
			{
				Serial.print("Unknow error at address 0x");
				if (address[nDevices]<16)
					Serial.print("0");
				Serial.println(address[nDevices], HEX);
			}
	}
	if (nDevices == 0)
	{
#ifdef PCF8574_M
		Serial.println("No PCF8574 devices found\n cannot continue!");
		write_message("No PCF devices found!!");
		delay(60000);
#endif
	}
	else
		Serial.println("done\n");

	//	return nDevices;
}

/** read hardware MAC */
#define MAC_CTRL_ID 0x50
bool OpenSprinkler::read_hardware_mac()
{
#if defined(ESP8266) || defined(ESP32)
	byte mac[6];
	if(!WiFi.macAddress(mac)) return false;
	for (byte i = 0; i < 6; i++) tmp_buffer[i ]= mac[i]; 
#else
    uint8_t ret;
    Wire.beginTransmission ( MAC_CTRL_ID );
    Wire.write ( ( uint8_t ) ( 0x00 ) );
    ret = Wire.endTransmission();
    if ( ret )  return false;

    Wire.beginTransmission ( MAC_CTRL_ID );
    Wire.write ( 0xFA ); // The address of the register we want
    Wire.endTransmission(); // Send the data
    Wire.requestFrom ( MAC_CTRL_ID, 6 ); // Request 6 bytes from the EEPROM
    while ( !Wire.available() ); // Wait for the response
    for ( ret=0; ret<6; ret++ )
    {
        tmp_buffer[ret] = Wire.read();
    }
#endif
    return true;
}

void ( * resetFunc ) ( void ) = 0; // AVR software reset function

/** Initialize network with the given mac address and http port */
byte OpenSprinkler::start_network( )
{

    lcd_print_line_clear_pgm ( PSTR ( "Connecting..." ), 1 );
    DEBUG_PRINTLN ( F ( "Connecting..." ) );

    // new from 2.2: read hardware MAC
#if defined( OPENSPRINKLER_ARDUINO) && !defined(ESP8266)
    // always use software MAC
    DEBUG_PRINTLN ( F ( "Setting software MAC " ) );
    tmp_buffer[0] = 0x00;
    tmp_buffer[1] = 0x69;
    tmp_buffer[2] = 0x69;
    tmp_buffer[3] = 0x2D;
    tmp_buffer[4] = 0x31;
    tmp_buffer[5] = options[OPTION_DEVICE_ID];
#else
    if ( !read_hardware_mac() )
    {
        // if no hardware MAC exists, use software MAC
        tmp_buffer[0] = 0x00;
        tmp_buffer[1] = 0x69;
        tmp_buffer[2] = 0x69;
        tmp_buffer[3] = 0x2D;
        tmp_buffer[4] = 0x31;
        tmp_buffer[5] = options[OPTION_DEVICE_ID];
    }
    else
    {
        // has hardware MAC chip
        status.has_hwmac = 1;
    }
#endif

    if ( !ether.begin ( ETHER_BUFFER_SIZE, ( uint8_t* ) tmp_buffer, PIN_ETHER_CS ) )
    {
        DEBUG_PRINTLN ( F ( "Ethernet initialisation failed - check wiring" ) );
        return 0;
    }
    else
    {
        DEBUG_PRINTLN ( F ( "Ethernet initialised" ) );
    }

    // calculate http port number
    ether.hisport = ( unsigned int ) ( options[OPTION_HTTPPORT_1]<<8 ) + ( unsigned int ) options[OPTION_HTTPPORT_0];
    DEBUG_PRINT ( F ( "Using http port " ) );
    DEBUG_PRINTLN ( ether.hisport );

