pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
    if ( options[OPTION_USE_DHCP] )
    {
        // set up DHCP
        // register with domain name "OS-xx" where xx is the last byte of the MAC address
		DEBUG_PRINT(F("DHCP IP setup"));
        if ( !ether.dhcpSetup() )
        {
            DEBUG_PRINTLN ( F ( " failed" ) );
			write_message("DHCP conn. failed");
            return 0;
        }

        // once we have valid DHCP IP, we write these into static IP / gateway IP
        byte *ip = ether.myip;
        options[OPTION_STATIC_IP1] = ip[0];
        options[OPTION_STATIC_IP2] = ip[1];
        options[OPTION_STATIC_IP3] = ip[2];
        options[OPTION_STATIC_IP4] = ip[3];

        ip = ether.gwip;
        options[OPTION_GATEWAY_IP1] = ip[0];
        options[OPTION_GATEWAY_IP2] = ip[1];
        options[OPTION_GATEWAY_IP3] = ip[2];
        options[OPTION_GATEWAY_IP4] = ip[3];
        options_save();
        DEBUG_PRINTLN ( F ( "DHCP IP setup successful" ) );
    }
    else
    {
        // set up static IP
        byte staticip[] =
        {
            options[OPTION_STATIC_IP1],
            options[OPTION_STATIC_IP2],
            options[OPTION_STATIC_IP3],
            options[OPTION_STATIC_IP4]
        };

        byte gateway[] =
        {
            options[OPTION_GATEWAY_IP1],
            options[OPTION_GATEWAY_IP2],
            options[OPTION_GATEWAY_IP3],
            options[OPTION_GATEWAY_IP4]
        };

		DEBUG_PRINT(F("Static IP setup "));

        if ( !ether.staticSetup ( staticip, gateway, gateway ) )
        {
            DEBUG_PRINTLN ( F ( "failed" ) );
			write_message("Static conn. failed");
            return 0;
        }
        else
        {
            DEBUG_PRINTLN ( F ( "successful" ) );
        }
    }
    DEBUG_PRINTLN ( F ( "Ethernet setup complete" ) );
    return 1;
}

/** Reboot controller */
void OpenSprinkler::reboot_dev()
{
#if defined(ESP8266) || defined(ESP32)
//	eeprom_write_byte((unsigned char *)(NVM_SIZE - 1), byte(charge / 25));
	write_message("restart");
	
	ESP.restart();
#else

    resetFunc();
#endif
}

#else // RPI/BBB/LINUX network init functions

#include "etherport.h"
#include <sys/reboot.h>
#include <stdlib.h>
#include "utils.h"
#include "server.h"

extern EthernetServer *m_server;
extern char ether_buffer[];

/** Initialize network with the given mac address and http port */
byte OpenSprinkler::start_network()
{
    unsigned int port = ( unsigned int ) ( options[OPTION_HTTPPORT_1]<<8 ) + ( unsigned int ) options[OPTION_HTTPPORT_0];
#if defined(DEMO)
    port = 80;
#endif
    if ( m_server )
    {
        delete m_server;
        m_server = 0;
    }

    m_server = new EthernetServer ( port );
    return m_server->begin();
}

/** Reboot controller */
void OpenSprinkler::reboot_dev()
{
#if defined(DEMO)
    // do nothing
#else
    sync(); // add sync to prevent file corruption
    reboot ( RB_AUTOBOOT );
#endif
}

LiquidCrystal_I2C OpenSprinkler::lcd(byte a, byte b, byte c, byte d, byte e, byte f, byte g, byte l)
{
	return LiquidCrystal_I2C();
}

/** Launch update script */
void OpenSprinkler::update_dev()
{
    char cmd[1024];
    sprintf ( cmd, "cd %s & ./updater.sh", get_runtime_path() );
    system ( cmd );
}
#endif // end network init functions

#if defined(ARDUINO)
/** Initialize LCD */
void OpenSprinkler::lcd_start()
{
#ifdef OPENSPRINKLER_ARDUINO_FREETRONICS_LCD
    //set up the LCD number of columns and rows:
    lcd.begin ( 16, 2 );
#else
    // turn on lcd
#ifndef LCDI2C
    lcd.init ( 1, PIN_LCD_RS, 255, PIN_LCD_EN, PIN_LCD_D4, PIN_LCD_D5, PIN_LCD_D6, PIN_LCD_D7, 0,0,0,0 );
    lcd.begin();

    if ( lcd.type() == LCD_STD )
    {
        // this is standard 16x2 LCD
        // set PWM frequency for adjustable LCD backlight and contrast
#if OS_HW_VERSION==(OS_HW_VERSION_BASE+20) || OS_HW_VERSION==(OS_HW_VERSION_BASE+21)  // 8MHz and 12MHz
        TCCR1B = 0x01;
#else // 16MHz
        TCCR1B = 0x02;  // increase division factor for faster clock
#endif
        // turn on LCD backlight and contrast
        lcd_set_brightness();
        lcd_set_contrast();
    }
    else
    {
        // for I2C LCD, we don't need to do anything
    }
#else  //for i2c library have to turn backligth on 

	
#ifndef LCD_SSD1306
	lcd.begin(20, 4);
	lcd.setBacklightPin(BACKLIGHT_PIN, PIN_BACKLIGHT_MODE);
	lcd.setBacklight(HIGH);
	lcd.home();
	lcd.print("start..V.2.1.6");

#else
	lcd.begin(SSD1306_SWITCHCAPVCC, 0x3c);
	lcd.display();
	delay(2000);
	lcd.clearDisplay();
	lcd.setTextColor(WHITE,BLACK); // white char clear background
	lcd.print("start..V.2.1.6");
	lcd.display();
#endif

	
#endif
#endif
}
#endif

extern void flow_isr();
/** Initialize pins, controller variables, LCD */
void OpenSprinkler::begin()
{
	// Init I2C
#if defined(ESP8266) || defined(ESP32)
	Wire.begin(SDA_PIN, SCL_PIN);
	DEBUG_PRINTLN("wire begin");
#else
	Wire.begin();
#endif

	ScanI2c();

#ifdef OPENSPRINKLER_ARDUINO_DISCRETE
#ifdef OSBEE
#if OSBEE == 1	
	setallpins(HIGH);
#else
	// initialize the Digital IO pins as outputs:
	for (int i = 0; i < (PIN_EXT_BOARDS * 8); i++)
	{		pinMode(station_pins[i], OUTPUT);

}
//	for (int i = 0; i < MAX_NUMBER_ZONES; i++) BeeClose(i);
  #endif
#endif
#else
    // shift register setup
#ifdef PIN_SSR_OE
    PINMODE ( PIN_SR_OE, OUTPUT );

    // pull shift register OE high to disable output
    digitalWrite ( PIN_SR_OE, HIGH );
#endif
	DEBUG_PRINTLN(PIN_SR_LATCH);
    pinMode ( PIN_SR_LATCH, OUTPUT );
    digitalWrite ( PIN_SR_LATCH, HIGH );
    pinMode ( PIN_SR_CLOCK, OUTPUT );
#endif // OPENSPRINKLER_ARDUINO_DISCRETE

#if defined(OSPI)
    pin_sr_data = PIN_SR_DATA;
    // detect RPi revisionOPENSPRINKLER_ARDUINO_DISCRETE
    unsigned int rev = detect_rpi_rev();
    if ( rev==0x0002 || rev==0x0003 )
        pin_sr_data = PIN_SR_DATA_ALT;
    // if this is revision 1, use PIN_SR_DATA_ALT
    PINMODE ( pin_sr_data, OUTPUT );
#else
#ifndef OPENSPRINKLER_ARDUINO_DISCRETE
    pinMode ( PIN_SR_DATA,  OUTPUT );
#endif
#endif

    // Reset all stations
    clear_all_station_bits();
    apply_all_station_bits();

#ifndef OPENSPRINKLER_ARDUINO_DISCRETE
#ifdef PIN_SR_OE
	// pull shift register OE low to enable output
    digitalWrite ( PIN_SR_OE, LOW );
#endif
#endif // OPENSPRINKLER_ARDUINO_DISCRETE
#ifdef PIN_RAINSENSOR
    // Rain sensor port set up
    pinMode ( PIN_RAINSENSOR, INPUT );

    // Set up sensors
#if defined(ARDUINO)
	digitalWrite ( PIN_RAINSENSOR, HIGH ); // enabled internal pullup on rain sensor
    attachInterrupt ( PIN_FLOWSENSOR_INT, flow_isr, FALLING );
#else
    // OSPI and OSBO use external pullups
    attachInterrupt ( PIN_FLOWSENSOR, "falling", flow_isr );
#endif
#endif
    // Default controller status variables
    // Static variables are assigned 0 by default
    // so only need to initialize non-zero ones
    status.enabled = 1;
    status.safe_reboot = 0;

    old_status = status;

    nvdata.sunrise_time = 360;  // 6:00am default sunrise
    nvdata.sunset_time = 1080;  // 6:00pm default sunset

