pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
    nboards = 1;
    nstations = 8;

#ifdef PIN_RF_DATA
    // set rf data pin
    PINMODE ( PIN_RF_DATA, OUTPUT );
    digitalWrite ( PIN_RF_DATA, LOW );
#endif

    hw_type = HW_TYPE_AC;
#if defined(ARDUINO)  // AVR SD and LCD functions
 
	

#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__) // OS 2.3 specific detections
    uint8_t ret;

    // detect hardware type
    Wire.beginTransmission ( MAC_CTRL_ID );
    Wire.write ( 0x00 );
    ret = Wire.endTransmission();
    if ( !ret )
    {
        Wire.requestFrom ( MAC_CTRL_ID, 1 );
        while ( !Wire.available() );
        ret = Wire.read();
        if ( ret == HW_TYPE_AC || ret == HW_TYPE_DC || ret == HW_TYPE_LATCH )
        {
            hw_type = ret;
        }
        else
        {
            // hardware type is not assigned
        }
    }

    if ( hw_type == HW_TYPE_DC )
    {
        PINMODE ( PIN_BOOST, OUTPUT );
        digitalWrite ( PIN_BOOST, LOW );

        PINMODE ( PIN_BOOST_EN, OUTPUT );
        digitalWrite ( PIN_BOOST_EN, LOW );
    }

    // detect if current sensing pin is present
    PINMODE ( PIN_CURR_DIGITAL, INPUT );
    digitalWrite ( PIN_CURR_DIGITAL, HIGH ); // enable internal pullup
    status.has_curr_sense = digitalRead ( PIN_CURR_DIGITAL ) ? 0 : 1;
    digitalWrite ( PIN_CURR_DIGITAL, LOW );
#endif

    lcd_start();
#ifndef LCD_SSD1306
    // define lcd custom icons
    byte _icon[8];
    // WiFi icon
    _icon[0] = B00000;
    _icon[1] = B10100;
    _icon[2] = B01000;
    _icon[3] = B10101;
    _icon[4] = B00001;
    _icon[5] = B00101;
    _icon[6] = B00101;
    _icon[7] = B10101;
    lcd.createChar ( 1, _icon );

    _icon[1]=0;
    _icon[2]=0;
    _icon[3]=1;
    lcd.createChar ( 0, _icon );

    // uSD card icon
    _icon[1] = B00000;
    _icon[2] = B11111;
    _icon[3] = B10001;
    _icon[4] = B11111;
    _icon[5] = B10001;
    _icon[6] = B10011;
    _icon[7] = B11110;
    lcd.createChar ( 2, _icon );

    // Rain icon
    _icon[2] = B00110;
    _icon[3] = B01001;
    _icon[4] = B11111;
    _icon[5] = B00000;
    _icon[6] = B10101;
    _icon[7] = B10101;
    lcd.createChar ( 3, _icon );

    // Connect icon
    _icon[2] = B00111;
    _icon[3] = B00011;
    _icon[4] = B00101;
    _icon[5] = B01000;
    _icon[6] = B10000;
    _icon[7] = B00000;
    lcd.createChar ( 4, _icon );

    // Remote extension icon
    _icon[2] = B00000;
    _icon[3] = B10001;
    _icon[4] = B01011;
    _icon[5] = B00101;
    _icon[6] = B01001;
    _icon[7] = B11110;
    lcd.createChar ( 5, _icon );

    // Flow sensor icon
    _icon[2] = B00000;
    _icon[3] = B11010;
    _icon[4] = B10010;
    _icon[5] = B11010;
    _icon[6] = B10011;
    _icon[7] = B00000;
    lcd.createChar ( 6, _icon );

#endif
#ifdef SDFAT 

    // set sd cs pin high to release SD
    pinMode ( PIN_SD_CS, OUTPUT );
    digitalWrite ( PIN_SD_CS, HIGH );
#if !defined(ESP8266) && !defined(ESP32)
    if ( sd.begin(PIN_SD_CS, SPI_HALF_SPEED))
#else
	if(SD.begin(PIN_SD_CS, SPI_HALF_SPEED))
#endif
    {
        status.has_sd = 1;
    }


#elif defined(SPIFFSDFAT)	
	long tot = 0;
	DEBUG_PRINTLN("Start SPIFFS....");
	if (SPIFFS.begin()) {
		Dir dir = SPIFFS.openDir("/");
		while (dir.next()) { DEBUG_PRINT(dir.fileName()); DEBUG_PRINT("  "); DEBUG_PRINTLN(dir.fileSize()); tot += dir.fileSize(); }
		status.has_sd = 1;
		DEBUG_PRINT("Tot.bytes="); DEBUG_PRINTLN(tot);
		lcd.setCursor(0, YFACTOR);
		lcd.print("Spiffs size=");
		lcd.print(tot);
		lcd.display();
		delay(1000);
	}
	else DEBUG_PRINTLN("Coundn't start SPIFFS");
#endif


#ifdef BUTTON_ADC_PIN
    pinMode ( BUTTON_ADC_PIN, INPUT );
#else
    // set button pins
    // enable internal pullup
    pinMode ( PIN_BUTTON_1, BUT1_ON == 0 ? INPUT_PULLUP : INPUT);
    pinMode ( PIN_BUTTON_2,  BUT2_ON == 0 ? INPUT_PULLUP : INPUT);
    pinMode ( PIN_BUTTON_3,BUT3_ON==0? INPUT_PULLUP:INPUT );
	DEBUG_PRINT("b1="); DEBUG_PRINTLN(digitalRead(PIN_BUTTON_1));
	DEBUG_PRINT("b2="); DEBUG_PRINTLN(digitalRead(PIN_BUTTON_2));
	DEBUG_PRINT("b3="); DEBUG_PRINTLN(digitalRead(PIN_BUTTON_3));
 //   DIGITALWRITE ( PIN_BUTTON_1, HIGH );
 //   DIGITALWRITE ( PIN_BUTTON_2, HIGH );
 //   DIGITALWRITE ( PIN_BUTTON_3, HIGH );
#endif // OPENSPRINKLER_ARDUINO_FREETRONICS_LCD

    // detect and check RTC type
#ifndef OPENSPRINKLER_ARDUINO
    RTC.detect();
#endif // OPENSPRINKLER_ARDUINO
#else
    DEBUG_PRINTLN ( get_runtime_path() );
#endif
}
////////////////////////////////code for OS bee 2.0///////////////


#ifdef OSBEE
///////////////////////defines for OS Bee////////////////////////////////////////////////////
//#define MAX_NUMBER_ZONES		3	//num.of zones_______________________needed
#define st_pins OpenSprinkler::station_pins		//pins used for attached Zones
//#define PIN_BST_PWR				2	//pin boost power____________________needed for OS Bee 2.0
//#define PIN_BST_EN				3	//bin boost enable___________________needed
//#define OSB_SOT_LATCH			4	//value of option for non latching valves___for OS Bee 2.0
////////////////////////////////////////////////////////////////////////////////////////////////

// open a zone by zone index
/* Set all pins (including COM)
* to a given value
*/
void setallpins(byte value) {
	static byte first = true;

	DEBUG_PRINT("Set "); DEBUG_PRINT(value); DEBUG_PRINT(" all pin:");
	if (first) {
		DEBUG_PRINTLN("setting mode....");
		first = false;
#if OSBEE == 1
		digitalWrite(PIN_COM, value);
		digitalWrite(PIN_BST_EN, LOW);
		digitalWrite(PIN_BST_PWR, LOW);
#endif
		pinMode(PIN_COM, OUTPUT);
		pinMode(PIN_BST_EN, OUTPUT);
		pinMode(PIN_BST_PWR, OUTPUT);

		for (byte i = 0; i < MAX_NUMBER_ZONES; i++) {
#if OSBEE == 1
			digitalWrite(st_pins[i], LOW);
#endif
			pinMode(st_pins[i], OUTPUT);
		}
	}
		DEBUG_PRINT("Set "); DEBUG_PRINT(value); DEBUG_PRINT(" all pin:");

		digitalWrite(PIN_COM, value);
	for (byte i = 0; i<MAX_NUMBER_ZONES; i++) {
		digitalWrite(st_pins[i], value);
		DEBUG_PRINT(st_pins[i]); DEBUG_PRINT(" ");
		delay(100);
	
	DEBUG_PRINTLN(" done");
	}
		
	
	
}
#if OSBEE==0
void boost(){
	// turn on boost converter for 500ms
	digitalWrite(PIN_BST_PWR,HIGH);
	delay(500);
	digitalWrite(PIN_BST_PWR, LOW);
}
void BeeOpen(byte zid) {
	byte pin = st_pins[zid];
	//  all pin set to v+
		// for latching solenoid
		boost();							// boost voltage
		setallpins(STA_HIGH);				// set all switches to HIGH, including COM
		delay(200);
		digitalWrite(pin, STA_LOW);			// set the specified switch to LOW
		DEBUG_PRINT("Open pin "); DEBUG_PRINT(pin);
		delay(200);
		digitalWrite(PIN_BST_EN, STA_HIGH);		// dump boosted voltage
		DEBUG_PRINT(" Boost..");
		delay(200);		// for 250ms
		digitalWrite(PIN_BST_EN, STA_LOW);  // disable boosted voltage
		DEBUG_PRINTLN("..sent");
		delay(100);
		digitalWrite(pin, STA_HIGH);        // set the specified switch back to HIGH
		delay(200);
		setallpins(STA_LOW);			// back to rest
}

// close a zone
void BeeClose(byte zid) {
	byte pin = st_pins[zid];
		// for latching solenoid
		boost();  // boost voltage
		setallpins(STA_LOW);        // set all switches to LOW, including COM
		delay(200);
		digitalWrite(pin, STA_HIGH);// set the specified switch to HIGH
		delay(200);
		DEBUG_PRINT("Close pin "); DEBUG_PRINT(pin);
		digitalWrite(PIN_BST_EN, STA_HIGH); // dump boosted voltage
		DEBUG_PRINT(" Boost..");
		
		delay(200);                     // for 250ms
		digitalWrite(PIN_BST_EN, STA_LOW);  // disable boosted voltage
		DEBUG_PRINTLN("..sent");
		delay(200);
		digitalWrite(pin, STA_LOW);     // set the specified switch back to LOW
	//	delay(500);
	//	setallpins(STA_LOW);               // set all switches back to rest
}
#else
void boost() {
	// turn on boost converter for 500ms
	digitalWrite(PIN_BST_PWR, HIGH);
	delay(500);
	digitalWrite(PIN_BST_PWR, LOW);
}
#define SPL_D(x) DEBUG_PRINTLN(x)
// open a zone by zone index
void BeeOpen(byte zid) {
	byte pin = st_pins[zid];
#ifdef OSBEE_NOLATCH

	if (options[OPTION_SOT].ival != OSB_SOT_LATCH)
	{
		DEBUG_PRINT("open_nl ");
		DEBUG_PRINTLN(zid);
		// for non-latching solenoid
		digitalWrite(PIN_BST_EN, LOW);  // disable output of boosted voltage 
		boost();                        // boost voltage
		digitalWrite(PIN_COM, HIGH);    // set COM to HIGH
		digitalWrite(PIN_BST_EN, HIGH); // dump boosted voltage    
		digitalWrite(pin, LOW);         // set specified switch to LOW
	}
	else
#endif
	{
		// for latching solenoid
		boost();  // boost voltage
		setallpins(HIGH);       // set all switches to HIGH, including COM
		SPL_D("allpin high");

		digitalWrite(pin, LOW); // set the specified switch to LOW
		DEBUG_PRINT(pin); SPL_D(" low");

		digitalWrite(PIN_BST_EN, HIGH); // dump boosted voltage
		SPL_D("enable boost");
		delay(300);                     // for 250ms
		digitalWrite(pin, HIGH);        // set the specified switch back to HIGH
		DEBUG_PRINT(pin); SPL_D(" high");

