pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
		}
		else 	if(volts < SLEEPING_VOLTS) {
//		WiFi.setSleepMode(WIFI_LIGHT_SLEEP);
//		wifi_fpm_set_sleep_type(LIGHT_SLEEP_T);
		lcd.setCursor(30, BOTTOM); 
		lcd.print("zzzzz"); 
		lcd.display();
		wifi_set_sleep_type(LIGHT_SLEEP_T);
		delay(L_SLEEP_TIME * 1000L);
		lcd.setCursor(100, BOTTOM);
		lcd.print("z");
		lcd.display();
		
	}
	else {
	//	lcd.setCursor(30, BOTTOM);
	//	lcd.print(volts);
	}
}
void OpenSprinkler::ShowNet() {
	if (second() % 60 == 0) {
		byte level = ether.WiFiLevel(0);
		DEBUG_PRINT("NetLev."); DEBUG_PRINTLN(level);
#define NET_X 19*XFACTOR
#define NET_Y BOTTOM-1
#define NET_S 150
		lcd.setCursor(NET_X-5, NET_Y);
		lcd.print("  ");

		lcd.drawBitmap(NET_X - 5, NET_Y, antenna5x9_bmp, 5, 9, WHITE);
		lcd.drawBitmap(NET_X , NET_Y, blank24x18_bmp, 10, 10, BLACK);

		lcd.drawTriangle(NET_X , NET_Y+YFACTOR,
			NET_X + (level*XFACTOR) / NET_S, NET_Y+YFACTOR,
			NET_X + (level*XFACTOR) / NET_S, NET_Y+YFACTOR - (YFACTOR*level) / NET_S, WHITE);
		lcd.display();
		
	}
}

int OpenSprinkler::BatteryAmps()
{
	return ina.getCurrent_mA();

}
int OpenSprinkler::BatteryCharge()
{
	return charge;

}

int OpenSprinkler::BatteryVoltage() {
	
#define INTERV_BATTERY 5
#define ANALOG_FACTOR 1.1*(4.9+22)/4.9/1024 //*3.4 if 3.33 v full scale //4.9 & 22 KOhm 3.3 volt scale
#ifdef INA219
	if (chargeTime == 0) {
		ina.begin();
		charge=25*eeprom_read_byte((unsigned char *)(NVM_SIZE - 1));
		if(charge==0||charge > options[BATTERY_mAH] * 100)charge = options[BATTERY_mAH] * 100;
		chargeTime = millis();
	}
	 float current = ina.getCurrent_mA();
	 float voltage = ina.getBusVoltage_V();// +ina.getShuntVoltage_mV() / 1000;
	  if(current<0)
		  charge -= current*(millis() - chargeTime) / 3600000;
	  else
		  charge -= current*(millis() - chargeTime) / 3600000*FACTOR;
	 chargeTime = millis();
	 if (charge < 50)charge = 50;
	 if (charge > options[BATTERY_mAH] * 100)charge = options[BATTERY_mAH] * 100;
	 if (minute() == 0 && second() > 58)eeprom_write_byte((unsigned char *)(NVM_SIZE - 1), byte(charge / 25));
	 lcd.setCursor(0, BOTTOM);
	 lcd.print(voltage);
	lcd.setCursor(30, BOTTOM);
	lcd.print("          ");
	lcd.setCursor(30, BOTTOM);
//	char buff[12];
	lcd.printf("%5d %5d",int(current),int(charge));
//	lcd.print(buff);
	//lcd.print(" ");	lcd.print(int(charge));
#endif
	if (minute() % INTERV_BATTERY == 0) {
		if (vcount == 0)voltAverage = 0;
		lcd.setCursor(0, BOTTOM);
		//lcd.drawBitmap(0, BOTTOM - 1, battery20x11_bmp, 20, 11, 0);
		float volt = analogRead(A0)*ANALOG_FACTOR;
		lcd.print(volt);
		voltAverage += volt * 100;
		vcount++;
		
			return 0;
	}
	else
		if (vcount>0) {
			lcd.setCursor(0, BOTTOM);
			lcd.print(voltAverage / vcount / 100.);
			lcd.display();
			voltAverage = voltAverage / vcount;
			delay(1000);
			vcount = 0;
		//	volts[ivolts] = voltAverage - 250;
		//	if (button_read(BUTTON_WAIT_NONE)&0x0F == 2)drawdiag(volts, ivolts);
		//	if (ivolts++ >= 100) {
		//		ivolts = 0;
		//	}
			return voltAverage;

		}
	return voltAverage;
		
}
void OpenSprinkler::drawdiag(byte y[], byte n) {
#define YDIAG 60
#define HDIAG 30
	lcd.clearDisplay();
	for (byte i = 0; i < n; i++) {
		lcd.drawFastVLine(2 + i, YDIAG - HDIAG*y[i] / 250, HDIAG*y[i] / 250, WHITE);
	/*	if (i*INTERV_BATTERY % 120 == 0) {
			lcd.setCursor(i, YDIAG);
			lcd.print(((hour() + 24) * 60 + minute() - (n-i) * INTERV_BATTERY) % 24);
		}*/
		
	}
	lcd.display();
}
#endif

/** Read rain sensor status */
void OpenSprinkler::rainsensor_status()
{
    // options[OPTION_RS_TYPE]: 0 if normally closed, 1 if normally open
    if ( options[OPTION_SENSOR_TYPE]!=SENSOR_TYPE_RAIN ) return;
	
     status.rain_sensed = (digitalRead(PIN_RAINSENSOR) == options[OPTION_RAINSENSOR_TYPE] ? 0 : 1 );
}

/** Read current sensing value
 * OpenSprinkler has a 0.2 ohm current sensing resistor.
 * Therefore the conversion from analog reading to milli-amp is:
 * (r/1024)*3.3*1000/0.2
 * Newer AC controller has a 0.2 ohm curent sensing resistor
 * with op-amp to sense the peak current. Therefore the actual
 * current is discounted by 0.707
 */
#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
uint16_t OpenSprinkler::read_current()
{
    if ( status.has_curr_sense )
    {
        if ( hw_type == HW_TYPE_DC )
        {
            return ( uint16_t ) ( analogRead ( PIN_CURR_SENSE ) * 16.11 );
        }
        else
        {
            return ( uint16_t ) ( analogRead ( PIN_CURR_SENSE ) * 11.39 );
        }
    }
    else
    {
        return 0;
    }
}
#endif

/** Read the number of 8-station expansion boards */
// AVR has capability to detect number of expansion boards
int OpenSprinkler::detect_exp()
{
#if defined(ARDUINO)
    unsigned int v = analogRead ( PIN_EXP_SENSE );
    // OpenSprinkler uses voltage divider to detect expansion boards
    // Master controller has a 1.6K pull-up;
    // each expansion board (8 stations) has 10K pull-down connected in parallel;
    // so the exact ADC value for n expansion boards is:
    //    ADC = 1024 * 10 / (10 + 1.6 * n)
    // For  0,   1,   2,   3,   4,   5,  6 expansion boards, the ADC values are:
    //   1024, 882, 775, 691, 624, 568, 522
    // Actual threshold is taken as the midpoint between, to account for errors
    int n = -1;
    if ( v > 953 ) // 0
    {
        n = 0;
    }
    else if ( v > 828 )   // 1
    {
        n = 1;
    }
    else if ( v > 733 )   // 2
    {
        n = 2;
    }
    else if ( v > 657 )   // 3
    {
        n = 3;
    }
    else if ( v > 596 )   // 4
    {
        n = 4;
    }
    else if ( v > 545 )   // 5
    {
        n = 5;
    }
    else if ( v > 502 )   // 6
    {
        n = 6;
    }
    else      // cannot determine
    {
    }
    return n;
#else
    return -1;
#endif
}

/** Convert hex code to ulong integer */
static ulong hex2ulong ( byte *code, byte len )
{
    char c;
    ulong v = 0;
    for ( byte i=0; i<len; i++ )
    {
        c = code[i];
        v <<= 4;
        if ( c>='0' && c<='9' )
        {
            v += ( c-'0' );
        }
        else if ( c>='A' && c<='F' )
        {
            v += 10 + ( c-'A' );
        }
        else if ( c>='a' && c<='f' )
        {
            v += 10 + ( c-'a' );
        }
        else
        {
            return 0;
        }
    }
    return v;
}

/** Parse RF code into on/off/timeing sections */
uint16_t OpenSprinkler::parse_rfstation_code ( byte *code, ulong* on, ulong *off )
{
    ulong v;
    v = hex2ulong ( code, 6 );
    if ( !v ) return 0;
    if ( on ) *on = v;
    v = hex2ulong ( code+6, 6 );
    if ( !v ) return 0;
    if ( off ) *off = v;
    v = hex2ulong ( code+12, 4 );
    if ( !v ) return 0;
    return v;
}

/** Get station name from NVM */
void OpenSprinkler::get_station_name ( byte sid, char tmp[] )
{
    tmp[STATION_NAME_SIZE]=0;
    nvm_read_block ( tmp, ( void* ) ( ADDR_NVM_STN_NAMES+ ( int ) sid*STATION_NAME_SIZE ), STATION_NAME_SIZE );
}

/** Set station name to NVM */
void OpenSprinkler::set_station_name ( byte sid, char tmp[] )
{
    tmp[STATION_NAME_SIZE]=0;
    nvm_write_block ( tmp, ( void* ) ( ADDR_NVM_STN_NAMES+ ( int ) sid*STATION_NAME_SIZE ), STATION_NAME_SIZE );
}

/** Save station attribute bits to NVM */
void OpenSprinkler::station_attrib_bits_save ( int addr, byte bits[] )
{
    nvm_write_block ( bits, ( void* ) addr, MAX_EXT_BOARDS+1 );
}

/** Load all station attribute bits from NVM */
void OpenSprinkler::station_attrib_bits_load ( int addr, byte bits[] )
{
    nvm_read_block ( bits, ( void* ) addr, MAX_EXT_BOARDS+1 );
}

/** Read one station attribute byte from NVM */
byte OpenSprinkler::station_attrib_bits_read ( int addr )
{
    return nvm_read_byte ( ( byte* ) addr );
}

