pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
/** verify if a string matches password */
byte OpenSprinkler::password_verify ( char *pw )
{
    byte *addr = ( byte* ) ADDR_NVM_PASSWORD;
    byte c1, c2;
    while ( 1 )
    {
        if ( addr == ( byte* ) ADDR_NVM_PASSWORD+MAX_USER_PASSWORD )
            c1 = 0;
        else
            c1 = nvm_read_byte ( addr++ );
        c2 = *pw++;
        if ( c1==0 || c2==0 )
            break;
        if ( c1!=c2 )
        {
            return 0;
        }
    }
    return ( c1==c2 ) ? 1 : 0;
}

// ==================
// Schedule Functions
// ==================

/** Index of today's weekday (Monday is 0) */
byte OpenSprinkler::weekday_today()
{
    //return ((byte)weekday()+5)%7; // Time::weekday() assumes Sunday is 1
#if defined(ARDUINO)
    ulong wd = now_tz() / 86400L;
    return ( wd+3 ) % 7; // Jan 1, 1970 is a Thursday
#else
    return 0;
    // todo: is this function needed for RPI/BBB?
#endif
}

/** Switch special station */
void OpenSprinkler::switch_special_station ( byte sid, byte value )
{
    // check station special bit
    if ( station_attrib_bits_read ( ADDR_NVM_STNSPE+ ( sid>>3 ) ) & ( 1<< ( sid&0x07 ) ) )
    {
        // read station special data from sd card
        int stepsize=sizeof ( StationSpecialData );
        read_from_file ( stns_filename, tmp_buffer, stepsize, sid*stepsize );
        StationSpecialData *stn = ( StationSpecialData * ) tmp_buffer;
        // check station type
        if ( stn->type==STN_TYPE_RF )
        {
            // transmit RF signal
#ifdef PORT_RF
            switch_rfstation ( stn->data, value );
#endif

		}
        else if ( stn->type==STN_TYPE_REMOTE )
        {
            // request remote station
            switch_remotestation ( stn->data, value );
        }
    }
}

/** Set station bit
 * This function sets/resets the corresponding station bit variable
 * You have to call apply_all_station_bits next to apply the bits
 * (which results in physical actions of opening/closing valves).
 */
byte OpenSprinkler::set_station_bit ( byte sid, byte value )
{
    byte *data = station_bits+ ( sid>>3 ); // pointer to the station byte
    byte mask = ( byte ) 1<< ( sid&0x07 ); // mask
    if ( value )
    {
        if ( ( *data ) &mask ) return 0; // if bit is already set, return no change
        else
        {
            ( *data ) = ( *data ) | mask;
#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
            engage_booster = true; // if bit is changing from 0 to 1, set engage_booster
#endif
            switch_special_station ( sid, 1 ); // handle special stations
            return 1;
        }
    }
    else
    {
        if ( ! ( ( *data ) &mask ) ) return 0; // if bit is already reset, return no change
        else
        {
            ( *data ) = ( *data ) & ( ~mask );
            switch_special_station ( sid, 0 ); // handle special stations
            return 255;
        }
    }
    return 0;
}

/** Clear all station bits */
void OpenSprinkler::clear_all_station_bits()
{
    byte sid;
    for ( sid=0; sid<=MAX_NUM_STATIONS; sid++ )
    {
        set_station_bit ( sid, 0 );
    }
}

#if !defined(ARDUINO)
int rf_gpio_fd = -1;
#endif

#ifdef PORT_RF
/** Transmit one RF signal bit */
void transmit_rfbit ( ulong lenH, ulong lenL )
{
#if defined(ARDUINO)
    PORT_RF |= ( 1<<PINX_RF );
    delayMicroseconds ( lenH );
    PORT_RF &=~ ( 1<<PINX_RF );
    delayMicroseconds ( lenL );
#else
    gpio_write ( rf_gpio_fd, 1 );
    delayMicrosecondsHard ( lenH );
    gpio_write ( rf_gpio_fd, 0 );
    delayMicrosecondsHard ( lenL );
#endif
}

/** Transmit RF signal */
void send_rfsignal ( ulong code, ulong len )
{
    ulong len3 = len * 3;
    ulong len31 = len * 31;
    for ( byte n=0; n<15; n++ )
    {
        int i=23;
        // send code
        while ( i>=0 )
        {
            if ( ( code>>i ) & 1 )
            {
                transmit_rfbit ( len3, len );
            }
            else
            {
                transmit_rfbit ( len, len3 );
            }
            i--;
        };
        // send sync
        transmit_rfbit ( len, len31 );
    }
}


/** Switch RF station
 * This function takes a RF code,
 * parses it into signals and timing,
 * and sends it out through RF transmitter.
 */
void OpenSprinkler::switch_rfstation ( byte *code, bool turnon )
{
    ulong on, off;
    uint16_t length = parse_rfstation_code ( code, &on, &off );
#if defined(ARDUINO)
    send_rfsignal ( turnon ? on : off, length );
#else
    // pre-open gpio file to minimize overhead
    rf_gpio_fd = gpio_fd_open ( PIN_RF_DATA );
    send_rfsignal ( turnon ? on : off, length );
    gpio_fd_close ( rf_gpio_fd );
    rf_gpio_fd = -1;
#endif

}
#endif
/** Callback function for remote station calls */
static void switchremote_callback ( byte status, uint16_t off, uint16_t len )
{
    /* do nothing */
}

/** Switch remote station
 * This function takes a remote station code,
 * parses it into remote IP, port, station index,
 * and makes a HTTP GET request.
 * The remote controller is assumed to have the same
 * password as the main controller
 */
void OpenSprinkler::switch_remotestation ( byte *code, bool turnon )
{
#if defined(ARDUINO)
    // construct string
    ulong ip = hex2ulong ( code, 8 );
    ether.hisip[0] = ip>>24;
    ether.hisip[1] = ( ip>>16 ) &0xff;
    ether.hisip[2] = ( ip>>8 ) &0xff;
    ether.hisip[3] = ip&0xff;

    uint16_t _port = ether.hisport; // save current port number
    ether.hisport = hex2ulong ( code+8, 4 );

    char *p = tmp_buffer + sizeof ( StationSpecialData );
    BufferFiller bf = ( byte* ) p;
    bf.emit_p ( PSTR ( "?pw=$E&sid=$D&en=$D&t=$D" ),
                ADDR_NVM_PASSWORD,
                ( int ) hex2ulong ( code+12,2 ),
                turnon, 2*MAX_NUM_STATIONS ); // MAX_NUM_STATIONS is the refresh cycle
    DEBUG_PRINTLN ( p );
    ether.browseUrl ( PSTR ( "/cm" ), p, PSTR ( "*" ), switchremote_callback );
    for ( int l=0; l<100; l++ )
    {
        ether.packetLoop ( ether.packetReceive() );
    }
    ether.hisport = _port;
#else
    EthernetClient client;

