pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
    uint8_t hisip[4];
    uint16_t hisport;
    ulong ip = hex2ulong ( code, 8 );
    hisip[0] = ip>>24;
    hisip[1] = ( ip>>16 ) &0xff;
    hisip[2] = ( ip>>8 ) &0xff;
    hisip[3] = ip&0xff;
    hisport = hex2ulong ( code+8, 4 );

    if ( !client.connect ( hisip, hisport ) )
    {
        client.stop();
        return;
    }

    char *p = tmp_buffer + sizeof ( StationSpecialData );
    BufferFiller bf = p;
    bf.emit_p ( PSTR ( "GET /cm?pw=$E&sid=$D&en=$D&t=$D" ),
                ADDR_NVM_PASSWORD,
                ( int ) hex2ulong ( code+12,2 ),
                turnon, 2*MAX_NUM_STATIONS ); // MAX_NUM_STATIONS is the refresh cycle
    bf.emit_p ( PSTR ( " HTTP/1.0\r\nHOST: *\r\n\r\n" ) );

    client.write ( ( uint8_t * ) p, strlen ( p ) );

    bzero ( ether_buffer, ETHER_BUFFER_SIZE );

    time_t timeout = now() + 5; // 5 seconds timeout
    while ( now() < timeout )
    {
        int len=client.read ( ( uint8_t * ) ether_buffer, ETHER_BUFFER_SIZE );
        if ( len<=0 )
        {
            if ( !client.connected() )
                break;
            else
                continue;
        }
        switchremote_callback ( 0, 0, ETHER_BUFFER_SIZE );
    }
    client.stop();
#endif
}

/** Setup function for options */
void OpenSprinkler::options_setup()
{

    // add 0.25 second delay to allow nvm to stablize
    delay ( 250 );
	
	int i = 0; char d;
	DEBUG_PRINTLN(DEFAULT_WEATHER_URL);
	DEBUG_PRINTLN(strlen(DEFAULT_WEATHER_URL));
	//while (d != 0) { d = eeprom_read_byte((byte*)ADDR_NVM_WEATHERURL + i++); DEBUG_PRINT(d); }
    byte curr_ver = nvm_read_byte ( ( byte* ) ( ADDR_NVM_OPTIONS+OPTION_FW_VERSION ) );
	DEBUG_PRINTLN((int)curr_ver);
    // check reset condition: either firmware version has changed, or reset flag is up
    // if so, trigger a factory reset
    if ( curr_ver != OS_FW_VERSION || nvm_read_byte ( ( byte* ) ( ADDR_NVM_OPTIONS+OPTION_RESET ) ) ==0xAA )
    {
#if defined(ARDUINO)
        lcd_print_line_clear_pgm ( PSTR ( "Resetting..." ), 0 );
        lcd_print_line_clear_pgm ( PSTR ( "Please Wait..." ), 1 );
		DEBUG_PRINTLN("Reset EEPROM");
		write_message("Resetting to factory default!");
#else
        DEBUG_PRINT ( "Resetting Options..." );
#endif
        // ======== Reset NVM data ========
        int i, sn;
        // 0. wipe out nvm
        for ( i=0; i<TMP_BUFFER_SIZE; i++ ) tmp_buffer[i]=0;
        for ( i=0; i<NVM_SIZE; i+=TMP_BUFFER_SIZE )
        {
			DEBUG_PRINT(i); 
			DEBUG_PRINT(' ');
			delay(100);
            int nbytes = ( ( NVM_SIZE-i ) >TMP_BUFFER_SIZE ) ?TMP_BUFFER_SIZE: ( NVM_SIZE-i );
            nvm_write_block ( tmp_buffer, ( void* ) i, nbytes );
        }
		DEBUG_PRINTLN("wiped");
        // 1. write non-volatile controller status
        nvdata_save();
		DEBUG_PRINTLN("nvdata");
        // 2. write string parameters
        nvm_write_block ( DEFAULT_PASSWORD, ( void* ) ADDR_NVM_PASSWORD, strlen ( DEFAULT_PASSWORD )+1 );
        nvm_write_block ( DEFAULT_LOCATION, ( void* ) ADDR_NVM_LOCATION, strlen ( DEFAULT_LOCATION )+1 );
        nvm_write_block ( DEFAULT_JAVASCRIPT_URL, ( void* ) ADDR_NVM_JAVASCRIPTURL, strlen ( DEFAULT_JAVASCRIPT_URL )+1 );
		DEBUG_PRINT(char(eeprom_read_byte((byte*)ADDR_NVM_JAVASCRIPTURL + strlen(DEFAULT_JAVASCRIPT_URL) + 1)&&0x0F));
		DEBUG_PRINTLN(char(eeprom_read_byte((byte*)ADDR_NVM_JAVASCRIPTURL + strlen(DEFAULT_JAVASCRIPT_URL) + 2)&&0x0F));
		nvm_write_block ( DEFAULT_WEATHER_URL, ( void* ) ADDR_NVM_WEATHERURL, strlen ( DEFAULT_WEATHER_URL )+1 );
        nvm_write_block ( DEFAULT_WEATHER_KEY, ( void* ) ADDR_NVM_WEATHER_KEY, strlen ( DEFAULT_WEATHER_KEY )+1 );

        // 3. reset station names and special attributes, default Sxx
        tmp_buffer[0]='S';
        tmp_buffer[3]=0;
        for ( i=ADDR_NVM_STN_NAMES, sn=1; i<ADDR_NVM_MAS_OP; i+=STATION_NAME_SIZE, sn++ )
        {
            tmp_buffer[1]='0'+ ( sn/10 );
            tmp_buffer[2]='0'+ ( sn%10 );
            nvm_write_block ( tmp_buffer, ( void* ) i, strlen ( tmp_buffer )+1 );
        }

        tmp_buffer[0]=STN_TYPE_STANDARD;
        tmp_buffer[1]='0';
        tmp_buffer[2]=0;
        int stepsize=sizeof ( StationSpecialData );
		DEBUG_PRINTLN("Preparing files");
		delay(1000);
        for ( i=0; i<MAX_NUM_STATIONS; i++ )
        {
            write_to_file ( stns_filename, tmp_buffer, stepsize, i*stepsize, false );
        }
		DEBUG_PRINTLN("file written");
        // 4. reset station attribute bits
        // since we wiped out nvm, only non-zero attributes need to be initialized
        for ( i=0; i<MAX_EXT_BOARDS+1; i++ )
        {
            tmp_buffer[i]=0xff;
        }
        nvm_write_block ( tmp_buffer, ( void* ) ADDR_NVM_MAS_OP, MAX_EXT_BOARDS+1 );
        nvm_write_block ( tmp_buffer, ( void* ) ADDR_NVM_STNSEQ, MAX_EXT_BOARDS+1 );

        // 5. delete sd file
        remove_file ( wtopts_filename );

        // 6. write options
        options_save(); // write default option values
		DEBUG_PRINTLN("done");
        //======== END OF NVM RESET CODE ========

        // restart after resetting NVM.
        delay ( 500 );
#if defined(ARDUINO)
        reboot_dev();
#endif
    }

    {
        // load ram parameters from nvm
        // load options
        options_load();

        // load non-volatile controller data
        nvdata_load();
    }

#if defined(ARDUINO)  // handle AVR buttons
    byte button = button_read ( BUTTON_WAIT_NONE );
	DEBUG_PRINT(button);
//	button = 2;
	byte ii = 1;

	switch (button & BUTTON_MASK)
	{

	case BUTTON_1:
		// if BUTTON_1 is pressed during startup, go to 'reset all options'
		ui_set_options(OPTION_RESET);
		if (options[OPTION_RESET])
		{
			reboot_dev();
		}
		break;

	case BUTTON_2:  // button 2 is used to enter bootloader
		ether.netflag = true;
		lcd_print_line_clear_pgm(PSTR("==Change Network=="), 0);
		delay(DISPLAY_MSG_MS);

		break;

    case BUTTON_3:
        // if BUTTON_3 is pressed during startup, enter Setup option mode
        lcd_print_line_clear_pgm ( PSTR ( "==Set Options==" ), 0 );
        delay ( DISPLAY_MSG_MS );
        lcd_print_line_clear_pgm ( PSTR ( "B1/B2:+/-, B3:->" ), 0 );
        lcd_print_line_clear_pgm ( PSTR ( "Hold B3 to save" ), 1 );
        do
        {
            button = button_read ( BUTTON_WAIT_NONE );
        }
        while ( ! ( button & BUTTON_FLAG_DOWN ) );
#ifndef LCD_SSD1306
		lcd.clear();
#else
		lcd.clearDisplay();
#endif
        ui_set_options ( 0 );
        if ( options[OPTION_RESET] )
        {
            reboot_dev();
        }
        break;
    }

