pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
    // turn on LCD backlight and contrast
    lcd_set_brightness();
    lcd_set_contrast();

    if ( !button )
	{
		DEBUG_PRINT("no but");
        // flash screen
        lcd_print_line_clear_pgm ( PSTR ( " OpenSprinkler" ),0 );
        lcd.setCursor ( 2*XFACTOR, 1*YFACTOR );
        lcd_print_pgm ( PSTR ( "HW v" ) );
        byte hwv = options[OPTION_HW_VERSION];
        lcd.print ( ( char ) ( '0'+ ( hwv/10 ) ) );
        lcd.print ( '.' );
        lcd.print ( ( char ) ( '0'+ ( hwv%10 ) ) );
        switch ( hw_type )
        {
        case HW_TYPE_DC:
            lcd_print_pgm ( PSTR ( " DC" ) );
            break;
        case HW_TYPE_LATCH:
            lcd_print_pgm ( PSTR ( " LA" ) );
            break;
        default:
            lcd_print_pgm ( PSTR ( " AC" ) );
        }

#ifdef LCD_SSD1306
		lcd.display();
#endif
        delay ( 1000 );
    }
#endif
}

/** Load non-volatile controller status data from internal NVM */
void OpenSprinkler::nvdata_load()
{
    nvm_read_block ( &nvdata, ( void* ) ADDR_NVM_NVCONDATA, sizeof ( NVConData ) );
    old_status = status;
}

/** Save non-volatile controller status data to internal NVM */
void OpenSprinkler::nvdata_save()
{
    nvm_write_block ( &nvdata, ( void* ) ADDR_NVM_NVCONDATA, sizeof ( NVConData ) );

}

/** Load options from internal NVM */
void OpenSprinkler::options_load()
{
    nvm_read_block ( tmp_buffer, ( void* ) ADDR_NVM_OPTIONS, NUM_OPTIONS );
    for ( int i=0; i<NUM_OPTIONS; i++ )
    {
        options[i] = tmp_buffer[i];
    }
    nboards = options[OPTION_EXT_BOARDS]+1;
    nstations = nboards * 8;
    status.enabled = options[OPTION_DEVICE_ENABLE];
    options[OPTION_FW_MINOR] = OS_FW_MINOR;
}

/** Save options to internal NVM */
void OpenSprinkler::options_save()
{
    // save options in reverse order so version number is written the last
	for (int i = 0; i<NUM_OPTIONS ; i++)
    {
        tmp_buffer[i] = options[i];
    }
	DEBUG_PRINT("OptionsWrite OS:"); DEBUG_PRINTLN((int)options[0]);
    nvm_write_block ( tmp_buffer, ( void* ) ADDR_NVM_OPTIONS, NUM_OPTIONS );
	DEBUG_PRINTLN((int)eeprom_read_byte((byte *)ADDR_NVM_OPTIONS));
    nboards = options[OPTION_EXT_BOARDS]+1;
    nstations = nboards * 8;
    status.enabled = options[OPTION_DEVICE_ENABLE];
}

// ==============================
// Controller Operation Functions
// ==============================

/** Enable controller operation */
void OpenSprinkler::enable()
{
    status.enabled = 1;
    options[OPTION_DEVICE_ENABLE] = 1;
    options_save();
}

/** Disable controller operation */
void OpenSprinkler::disable()
{
    status.enabled = 0;
    options[OPTION_DEVICE_ENABLE] = 0;
    options_save();
}

/** Start rain delay */
void OpenSprinkler::raindelay_start()
{
    status.rain_delayed = 1;
    nvdata_save();
}

/** Stop rain delay */
void OpenSprinkler::raindelay_stop()
{
    status.rain_delayed = 0;
    nvdata.rd_stop_time = 0;
    nvdata_save();
}

/** LCD and button functions */
void OpenSprinkler::lcd_clear() {
#ifndef LCD_SSD1306
	lcd.clear();
#else
	lcd.clearDisplay();
#endif
}
#if defined(ARDUINO)    // AVR LCD and button functions
/** print a program memory string */
void OpenSprinkler::lcd_print_pgm ( PGM_P /*PROGMEM*/ str )
{
    uint8_t c;
    while ( ( c=pgm_read_byte ( str++ ) ) != '\0' )
    {
        lcd.print ( ( char ) c );
    }
#ifdef LCD_SSD1306
	lcd.display();
#endif
}

/** print a program memory string to a given line with clearing */
void OpenSprinkler::lcd_print_line_clear_pgm ( PGM_P /*PROGMEM*/ str, byte line )
{
    lcd.setCursor ( 0, line*YFACTOR );
    uint8_t c;
    int8_t cnt = 0;
    while ( ( c=pgm_read_byte ( str++ ) ) != '\0' )
    {
        lcd.print ( ( char ) c );
        cnt++;
    }
    for ( ; ( 16-cnt ) >= 0; cnt ++ ) lcd_print_pgm ( PSTR ( " " ) );

#ifdef LCD_SSD1306
	lcd.display();
#endif
}

void OpenSprinkler::lcd_print_2digit ( int v )
{
    lcd.print ( ( int ) ( v/10 ) );
    lcd.print ( ( int ) ( v%10 ) );
}

/** print time to a given line */
void OpenSprinkler::lcd_print_time ( time_t t )
{
    lcd.setCursor ( 0, 0 );
    lcd_print_2digit ( hour ( t ) );

#ifdef OPENSPRINKLER_ARDUINO_HEARTBEAT
    lcd_print_pgm ( ( t % 2 == 0 ? PSTR ( ":" ) : PSTR ( " " ) ) );
#else
    lcd_print_pgm ( PSTR ( ":" ) );
#endif // OPENSPRINKLER_ARDUINO_HEARTBEAT

    lcd_print_2digit ( minute ( t ) );
    lcd_print_pgm ( PSTR ( "  " ) );
    // each weekday string has 3 characters + ending 0
    lcd_print_pgm ( days_str+4*weekday_today() );
    lcd_print_pgm ( PSTR ( " " ) );
    lcd_print_2digit ( month ( t ) );
    lcd_print_pgm ( PSTR ( "-" ) );
    lcd_print_2digit ( day ( t ) );

#ifdef LCD_SSD1306
	lcd.display();
#endif
}

/** print ip address */
void OpenSprinkler::lcd_print_ip ( const byte *ip, byte endian )
{

    lcd_clear();

    lcd.setCursor ( 0, 0 );
    for ( byte i=0; i<4; i++ )
    {
        lcd.print ( endian ? ( int ) ip[3-i] : ( int ) ip[i] );
        if ( i<3 ) lcd_print_pgm ( PSTR ( "." ) );
    }

#ifdef LCD_SSD1306
	lcd.display();
#endif
}

/** print mac address */
void OpenSprinkler::lcd_print_mac ( const byte *mac )
{
    lcd.setCursor ( 0, 0 );
    for ( byte i=0; i<6; i++ )
    {
        if ( i )  lcd_print_pgm ( PSTR ( "-" ) );
        lcd.print ( ( mac[i]>>4 ), HEX );
        lcd.print ( ( mac[i]&0x0F ), HEX );
        if ( i==4 ) lcd.setCursor ( 0, YFACTOR );
    }
    lcd_print_pgm ( PSTR ( " (MAC)" ) );

#ifdef LCD_SSD1306
	lcd.display();
#endif
}

/** print station bits */
void OpenSprinkler::lcd_print_station(byte line, char c)
{
#ifdef LCD_SSD1306
	lcd.setTextSize(2);
#endif
	lcd.setCursor(0, line*YFACTOR);
	if (status.display_board == 0)
	{
		lcd_print_pgm(PSTR("MC")); // Master controller is display as 'MC'
	}
	else
	{
		lcd_print_pgm(PSTR("E"));
		lcd.print((int)status.display_board);
		lcd_print_pgm(PSTR("")); // extension boards are displayed as E1, E2...
	}

	if (!status.enabled)
	{
		lcd_print_line_clear_pgm(PSTR("-Disabled!-"), 1);
	}
	else
	{
		byte xchar = 2;
		byte bitvalue = station_bits[status.display_board];
		for (byte s = 0; s < 8; s++)
		{
			byte sid = (byte)status.display_board << 3;
			sid += (s + 1);
			if (sid == options[OPTION_MASTER_STATION])
			{
#ifndef LCD_SSD1306x
				lcd.print((bitvalue & 1) ? (char)c : 'M'); // print master station
#else
				lcd.drawBitmap(2 * XFACTOR*xchar++, YFACTOR, (bitvalue & 1) ? valveOpen10x16_bmp : valveClosed10x16_bmp, 10, 16, WHITE);
#endif
			}
			else if (sid == options[OPTION_MASTER_STATION_2])
			{
				lcd.print((bitvalue & 1) ? (char)c : 'N'); // print master2 station
			}
			else
			{
// ------------if station is disabled -------------------------------------------
				if(station_attrib_bits_read ( ADDR_NVM_STNDISABLE ) & ( 1<<s ) )lcd.print((bitvalue & 1) ? (char)c : '-'); // print master station
				else
//----------normal active station
				lcd.print((bitvalue & 1) ? (char)c : '_'); // print master station

//				lcd.drawBitmap(2 * XFACTOR*xchar++, YFACTOR, (bitvalue & 1) ? valveOpen10x16_bmp : valveClosed10x16_bmp, 10, 16, WHITE);

