pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
			}
			bitvalue >>= 1;
		}
	}
#ifndef LCD_SSD1306
	lcd_print_pgm(PSTR("     "));
	lcd.setCursor(12, 1);

	if (options[OPTION_REMOTE_EXT_MODE])
	{
		lcd.write(5);
	}
	lcd.setCursor(13 , 1);
#endif

	if (status.rain_delayed || (status.rain_sensed && options[OPTION_SENSOR_TYPE] == SENSOR_TYPE_RAIN))
	{
#ifndef LCD_SSD1306
		
		lcd.write(3);
#else
		lcd.drawBitmap(117, 0, rain10x10_bmp, 10, 10, WHITE);
#endif

	}
	if (options[OPTION_SENSOR_TYPE] == SENSOR_TYPE_FLOW)
	{
		lcd.write(6);
	}

	if (status.has_sd)
	{

#ifndef LCD_SSD1306
		lcd.setCursor(14, 1);
		lcd.write(2);
#else
		lcd.drawBitmap(16*XFACTOR, 0, sdisk10x10_bmp, 10, 10, WHITE);
#endif
	}

#ifndef LCD_SSD1306
	lcd.setCursor(15, 1);
	lcd.write(status.network_fails>2 ? 1 : 0); // if network failure detection is more than 2, display disconnect icon
#else
	lcd.drawBitmap(18*XFACTOR, 0, antenna5x9_bmp, 5, 9, WHITE);
#endif
    
#ifdef LCD_SSD1306
	lcd.display();
	lcd.setTextSize(1);
#endif
}

/** print a version number */
void OpenSprinkler::lcd_print_version ( byte v )
{
    if ( v > 99 )
    {
        lcd.print ( v/100 );
        lcd.print ( "." );
    }
    if ( v>9 )
    {
        lcd.print ( ( v/10 ) %10 );
        lcd.print ( "." );
    }
    lcd.print ( v%10 );

#ifdef LCD_SSD1306
	lcd.display();
#endif
}

/** print an option value */
void OpenSprinkler::lcd_print_option ( int i )
{
    // each prompt string takes 16 characters
    strncpy_P0 ( tmp_buffer, op_prompts+16*i, 16 );
    lcd.setCursor ( 0, 0 );
    lcd.print ( tmp_buffer );
    lcd_print_line_clear_pgm ( PSTR ( "" ), 1 );
    lcd.setCursor ( 0, YFACTOR );
    int tz;
    switch ( i )
    {
    case OPTION_HW_VERSION:
        lcd.print ( "v" );
    case OPTION_FW_VERSION:
        lcd_print_version ( options[i] );
        break;
    case OPTION_TIMEZONE: // if this is the time zone option, do some conversion
        tz = ( int ) options[i]-48;
        if ( tz>=0 ) lcd_print_pgm ( PSTR ( "+" ) );
        else
        {
            lcd_print_pgm ( PSTR ( "-" ) );
            tz=-tz;
        }
        lcd.print ( tz/4 ); // print integer portion
        lcd_print_pgm ( PSTR ( ":" ) );
        tz = ( tz%4 ) *15;
        if ( tz==0 )  lcd_print_pgm ( PSTR ( "00" ) );
        else
        {
            lcd.print ( tz ); // print fractional portion
        }
        break;
    case OPTION_MASTER_ON_ADJ:
    case OPTION_MASTER_ON_ADJ_2:
        lcd_print_pgm ( PSTR ( "+" ) );
        lcd.print ( ( int ) options[i] );
        break;
    case OPTION_MASTER_OFF_ADJ:
    case OPTION_MASTER_OFF_ADJ_2:
        if ( options[i]>=60 )  lcd_print_pgm ( PSTR ( "+" ) );
        lcd.print ( ( int ) options[i]-60 );
        break;
    case OPTION_HTTPPORT_0:
        lcd.print ( ( unsigned int ) ( options[i+1]<<8 )+options[i] );
        break;
    case OPTION_PULSE_RATE_0:
    {
        uint16_t fpr = ( unsigned int ) ( options[i+1]<<8 )+options[i];
        lcd.print ( fpr/100 );
        lcd_print_pgm ( PSTR ( "." ) );
        lcd.print ( ( fpr/10 ) %10 );
        lcd.print ( fpr%10 );
    }
    break;
    case OPTION_STATION_DELAY_TIME:
        lcd.print ( water_time_decode_signed ( options[i] ) );
        break;
    case OPTION_LCD_CONTRAST:
        lcd_set_contrast();
        lcd.print ( ( int ) options[i] );
        break;
    case OPTION_LCD_BACKLIGHT:
        lcd_set_brightness();
        lcd.print ( ( int ) options[i] );
        break;
    case OPTION_BOOST_TIME:
#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
        if ( hw_type==HW_TYPE_AC )
        {
            lcd.print ( '-' );
        }
        else
        {
            lcd.print ( ( int ) options[i]*4 );
            lcd_print_pgm ( PSTR ( " ms" ) );
        }
#else
        lcd.print ( '-' );
#endif
        break;
    default:
        // if this is a boolean option
        if ( pgm_read_byte ( op_max+i ) ==1 )
            lcd_print_pgm ( options[i] ? PSTR ( "Yes" ) : PSTR ( "No" ) );
        else
            lcd.print ( ( int ) options[i] );
        break;
    }
    if ( i==OPTION_WATER_PERCENTAGE )  lcd_print_pgm ( PSTR ( "%" ) );
    else if ( i==OPTION_MASTER_ON_ADJ || i==OPTION_MASTER_OFF_ADJ || i==OPTION_MASTER_ON_ADJ_2 || i==OPTION_MASTER_OFF_ADJ_2 )
        lcd_print_pgm ( PSTR ( " sec" ) );

#ifdef LCD_SSD1306
	lcd.display();
#endif
}

/** Button functions */

#ifdef BUTTON_ADC_PIN
// Wait for button
byte OpenSprinkler::button_read_busy ( byte pin_butt, byte waitmode, byte butt, byte is_holding )
{

    int hold_time = 0;

    if ( waitmode == BUTTON_WAIT_NONE || ( waitmode == BUTTON_WAIT_HOLD && is_holding ) )
    {
        if ( button_sample() == BUTTON_NONE ) return BUTTON_NONE;
        return butt | ( is_holding ? BUTTON_FLAG_HOLD : 0 );
    }

    while ( button_sample() != BUTTON_NONE &&
            ( waitmode == BUTTON_WAIT_RELEASE || ( waitmode == BUTTON_WAIT_HOLD && hold_time<BUTTON_HOLD_MS ) ) )
    {
        delay ( BUTTON_DELAY_MS );
        hold_time += BUTTON_DELAY_MS;
    };
    if ( is_holding || hold_time >= BUTTON_HOLD_MS )
        butt |= BUTTON_FLAG_HOLD;
    return butt;

}

// Read button and returns button value 'OR'ed with flag bits
byte OpenSprinkler::button_read ( byte waitmode )
{
    static byte old = BUTTON_NONE;
    byte curr = BUTTON_NONE;
    byte is_holding = ( old&BUTTON_FLAG_HOLD );

    delay ( BUTTON_DELAY_MS );

    curr = button_sample();
	//DEBUG_PRINTLN(curr);
    // A normal opensprinkler is only 3 buttons - map them to the five buttons of the LCD shield
    // Button 1 = Increase  = Up and Right
    // Button 2 = Decrease = Down and Left
    // Button 3 = Select = Select
    switch ( curr )
    {
    case BUTTON_UP:
    case BUTTON_RIGHT:
        curr = button_read_busy ( BUTTON_ADC_PIN, waitmode, BUTTON_1, is_holding );
        ;
        break;

    case BUTTON_DOWN:
    case BUTTON_LEFT:
        curr = button_read_busy ( BUTTON_ADC_PIN, waitmode, BUTTON_2, is_holding );
        break;

    case BUTTON_SELECT:
        curr = button_read_busy ( BUTTON_ADC_PIN, waitmode, BUTTON_3, is_holding );
        break;

    default:
        curr = BUTTON_NONE;
    }
	//DEBUG_PRINTLN(curr);
    /* set flags in return value */
    byte ret = curr;
    if ( ! ( old&BUTTON_MASK ) && ( curr&BUTTON_MASK ) )
        ret |= BUTTON_FLAG_DOWN;
    if ( ( old&BUTTON_MASK ) && ! ( curr&BUTTON_MASK ) )
        ret |= BUTTON_FLAG_UP;

    old = curr;
    return ret;
}

