pbecchi/ESP32-Sprinkler/OpenSprinkler.cpp
byte OpenSprinkler::button_sample()
{
    unsigned int buttonVoltage;

    //read the button ADC pin voltage
    buttonVoltage = analogRead ( BUTTON_ADC_PIN );
	//DEBUG_PRINTLN(buttonVoltage);
    //sense if the voltage falls within valid voltage windows
	//avoid to pick 0 volt as Button right ...
    if ( buttonVoltage < ( RIGHT_10BIT_ADC + BUTTONHYSTERESIS )&& buttonVoltage > (RIGHT_10BIT_ADC - BUTTONHYSTERESIS))
    {
        return BUTTON_RIGHT;
    }
    else if ( buttonVoltage >= ( UP_10BIT_ADC - BUTTONHYSTERESIS )
              && buttonVoltage <= ( UP_10BIT_ADC + BUTTONHYSTERESIS ) )
    {
        return BUTTON_UP;
    }
    else if ( buttonVoltage >= ( DOWN_10BIT_ADC - BUTTONHYSTERESIS )
              && buttonVoltage <= ( DOWN_10BIT_ADC + BUTTONHYSTERESIS ) )
    {
        return BUTTON_DOWN;
    }
    else if ( buttonVoltage >= ( LEFT_10BIT_ADC - BUTTONHYSTERESIS )
              && buttonVoltage <= ( LEFT_10BIT_ADC + BUTTONHYSTERESIS ) )
    {
        return BUTTON_LEFT;
    }
    else if ( buttonVoltage >= ( SELECT_10BIT_ADC - BUTTONHYSTERESIS )
              && buttonVoltage <= ( SELECT_10BIT_ADC + BUTTONHYSTERESIS ) )
    {
        return BUTTON_SELECT;
    }
    else
        return BUTTON_NONE;
}
#else
/** wait for button */
byte OpenSprinkler::button_read_busy ( byte pin_butt, byte waitmode, byte butt, byte is_holding )
{
	byte but_on = 0 ;
	if (pin_butt == PIN_BUTTON_1)but_on = BUT1_ON;
	else if (pin_butt == PIN_BUTTON_2)but_on = BUT2_ON;
	else but_on = BUT3_ON;

    int hold_time = 0;

    if ( waitmode==BUTTON_WAIT_NONE || ( waitmode == BUTTON_WAIT_HOLD && is_holding ) )
    {
        if (( digitalRead ( pin_butt ) )!= but_on ) return BUTTON_NONE;
        return butt | ( is_holding ? BUTTON_FLAG_HOLD : 0 );
    }

    while ( (digitalRead ( pin_butt ) )== but_on &&
            ( waitmode == BUTTON_WAIT_RELEASE || ( waitmode == BUTTON_WAIT_HOLD && hold_time<BUTTON_HOLD_MS ) ) )
    {
        delay ( BUTTON_DELAY_MS );
        hold_time += BUTTON_DELAY_MS;
    };
    if ( is_holding || hold_time >= BUTTON_HOLD_MS )
        butt |= BUTTON_FLAG_HOLD;
    return butt;

}

/** read button and returns button value 'OR'ed with flag bits */
byte OpenSprinkler::button_read ( byte waitmode )
{
    static byte old = BUTTON_NONE;
    byte curr = BUTTON_NONE;
    byte is_holding = ( old&BUTTON_FLAG_HOLD );

    delay ( BUTTON_DELAY_MS );
	byte but1 = digitalRead(PIN_BUTTON_1);
	byte but2 = digitalRead(PIN_BUTTON_2);
	byte but3 = digitalRead(PIN_BUTTON_3);
    if (  but1== BUT1_ON )
    {
		DEBUG_PRINT("b1="); DEBUG_PRINT(but1);
        curr = button_read_busy ( PIN_BUTTON_1, waitmode, BUTTON_1, is_holding );
    }
    else if ( but2 == BUT2_ON )
    {   
		DEBUG_PRINT("b2="); DEBUG_PRINT(but2);
        curr = button_read_busy ( PIN_BUTTON_2, waitmode, BUTTON_2, is_holding );
    }
    else if ( but3 == BUT3_ON )
    {
		DEBUG_PRINT("b3="); DEBUG_PRINT(but3);
        curr = button_read_busy ( PIN_BUTTON_3, waitmode, BUTTON_3, is_holding );
    }
	//DEBUG_PRINTLN('r');
    // set flags in return value
    byte ret = curr;
    if ( ! ( old&BUTTON_MASK ) && ( curr&BUTTON_MASK ) )
        ret |= BUTTON_FLAG_DOWN;
    if ( ( old&BUTTON_MASK ) && ! ( curr&BUTTON_MASK ) )
        ret |= BUTTON_FLAG_UP;

    old = curr;
    return ret;
}
#endif //BUTTON_ADC_PIN .... OPENSPRINKLER_ARDUINO_FREETRONICS_LCD

/** user interface for setting options during startup */
void OpenSprinkler::ui_set_options ( int oid )
{
    boolean finished = false;
    byte button;
    int i=oid;

    while ( !finished )
    {
        button = button_read ( BUTTON_WAIT_HOLD );

        switch ( button & BUTTON_MASK )
        {
        case BUTTON_1:
            if ( i==OPTION_FW_VERSION || i==OPTION_HW_VERSION || i==OPTION_FW_MINOR ||
                    i==OPTION_HTTPPORT_0 || i==OPTION_HTTPPORT_1 ||
                    i==OPTION_PULSE_RATE_0 || i==OPTION_PULSE_RATE_1 ) break; // ignore non-editable options
            if ( pgm_read_byte ( op_max+i ) != options[i] ) options[i] ++;
            break;

        case BUTTON_2:
            if ( i==OPTION_FW_VERSION || i==OPTION_HW_VERSION || i==OPTION_FW_MINOR ||
                    i==OPTION_HTTPPORT_0 || i==OPTION_HTTPPORT_1 ||
                    i==OPTION_PULSE_RATE_0 || i==OPTION_PULSE_RATE_1 ) break; // ignore non-editable options
            if ( options[i] != 0 ) options[i] --;
            break;

        case BUTTON_3:
            if ( ! ( button & BUTTON_FLAG_DOWN ) ) break;
            if ( button & BUTTON_FLAG_HOLD )
            {
                // if OPTION_RESET is set to nonzero, change it to reset condition value
                if ( options[OPTION_RESET] )
                {
                    options[OPTION_RESET] = 0xAA;
                }
                // long press, save options
                options_save();
                finished = true;
            }
            else
            {
                // click, move to the next option
                if ( i==OPTION_USE_DHCP && options[i] ) i += 9; // if use DHCP, skip static ip set
                else if ( i==OPTION_HTTPPORT_0 ) i+=2; // skip OPTION_HTTPPORT_1
                else if ( i==OPTION_PULSE_RATE_0 ) i+=2; // skip OPTION_PULSE_RATE_1
                else if ( i==OPTION_SENSOR_TYPE && options[i]!=SENSOR_TYPE_RAIN ) i+=2; // if not using rain sensor, skip rain sensor type
                else if ( i==OPTION_MASTER_STATION && options[i]==0 ) i+=3; // if not using master station, skip master on/off adjust
                else if ( i==OPTION_MASTER_STATION_2&& options[i]==0 ) i+=3; // if not using master2, skip master2 on/off adjust
                else
                {
                    i = ( i+1 ) % NUM_OPTIONS;
                }
                if ( i==OPTION_SEQUENTIAL_RETIRED ) i++;
            }
            break;
        }

        if ( button != BUTTON_NONE )
        {
            lcd_print_option ( i );
        }
    }
#ifndef LCD_SSD1306
	lcd.noBlink();
#else

#endif
    
}

/** Set LCD contrast (using PWM) */
void OpenSprinkler::lcd_set_contrast()
{
#ifndef OPENSPRINKLER_ARDUINO_FREETRONICS_LCD
#ifndef LCDI2C
    // set contrast is only valid for standard LCD
    if ( lcd.type() ==LCD_STD )
    {
        pinMode ( PIN_LCD_CONTRAST, OUTPUT );
        analogWrite ( PIN_LCD_CONTRAST, options[OPTION_LCD_CONTRAST] );
    }
#endif
#endif

}

/** Set LCD brightness (using PWM) */
void OpenSprinkler::lcd_set_brightness ( byte value )
{
#ifdef OPENSPRINKLER_ARDUINO_FREETRONICS_LCD
	// value of 1 = on bright / 0 = dim
    pinMode ( PIN_LCD_BACKLIGHT, OUTPUT );
	if (value == 1)
		LCD_BACKLIGHT_ON();
	else
		LCD_BACKLIGHT_OFF();
#else
#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
    if ( lcd.type() ==LCD_I2C )
    {
        if ( value ) lcd.backlight();
        else lcd.noBacklight();
    }

#endif
#ifndef LCDI2C
    if ( lcd.type() ==LCD_STD )
    {
        pinMode ( PIN_LCD_BACKLIGHT, OUTPUT );
        if ( value )
        {
            analogWrite ( PIN_LCD_BACKLIGHT, 255-options[OPTION_LCD_BACKLIGHT] );
        }
        else
        {
            analogWrite ( PIN_LCD_BACKLIGHT, 255-options[OPTION_LCD_DIMMING] );
        }
    }
#else
	if (value == 1)
		digitalWrite(PIN_LCD_BACKLIGHT, LOW);
	else
		digitalWrite(PIN_LCD_BACKLIGHT, HIGH);
#endif
#endif // OPENSPRINKLER_ARDUINO_FREETRONICS_LCD
}
#endif  // end of LCD and button functions

#ifdef OPENSPRINKLER_ARDUINO_FREEMEM
// ==================
// Print free memory for debugging
// ==================
void OpenSprinkler::lcd_print_memory ( byte line )
{
    lcd.setCursor ( 0, line );
    lcd_print_pgm ( PSTR ( "Free RAM:        " ) );

    lcd.setCursor ( 10, line );
    lcd.print ( freeMemory() );

    lcd.setCursor ( 15, line );
    lcd.write ( status.network_fails>0 ? 1 : 0 );
}
#endif

